Homework.tex
% Created 2016-10-10 Mon 00:21
\documentclass[a4paper, unicode]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[a4paper, left=2.5cm,right=2cm,top=2cm,bottom=2cm]{geometry}
\usepackage[russian]{babel}             % Russian translations
\usepackage{amssymb,amsmath,amsthm}     % Mathematic symbols, theorems, etc.
\author{Dmitry Mukhutdinov}
\date{\today}
\title{Домашние задания по курсу машинного обучения}
\hypersetup{
 pdfauthor={Dmitry Mukhutdinov},
 pdftitle={Домашние задания по курсу машинного обучения},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.5.2 (Org mode 8.3.5)},
 pdflang={Russian}}
\begin{document}

\maketitle
\tableofcontents


\section{Задание 1.}
\label{sec:orgheadline6}
\subsection{Постановка задачи}
\label{sec:orgheadline1}
\begin{enumerate}
\item Реализовать метрический классификатор kNN
\item Сделать кросс-валидацию; обосновать выбор числа фолдов для нее
\item Выполнить визуализацию данных
\item Настроить классификатор с 2-3 метриками и 2-3 пространственными преобразованиями
\item Для оценки качества можно использовать метрику accuracy, но лучше - f1-measure
\end{enumerate}
\subsection{Датасет}
\label{sec:orgheadline2}
Ссылка: \url{https://www.dropbox.com/s/lolwyijk22xu7na/chips.txt?dl=0}

Датасет представляет собой набор 2d-точек, разбитых на 2 класса.
\subsection{Hints}
\label{sec:orgheadline3}
\begin{enumerate}
\item Нарисуйте график, изображающий точки из разных классов разными цветами. Сразу
станет понятно, где примерно должна проходить граница разделения классов.
\item Добавьте пространственные преобразования, которые хорошо разделяют датасет.
Таким, например, является параболоид с центром в среднем арифметическом всех точек.
\end{enumerate}

\subsection{FAQ}
\label{sec:orgheadline4}
\begin{enumerate}
\item \textbf{Вопрос:}
   Что такое метрический классификатор?

\textbf{Ответ:}
Это алгоритм классификации, который основан на понятии \textbf{сходства} между
объектами. При классификации очередного объекта решение принимается на основе
известных ответов для объектов, схожих с данным. Обычно функция сходства
является \textbf{метрикой}, но необязательно (например, может нарушаться равенство
треугольника).

\item \textbf{Вопрос:}
   Что будет, если \(k = 0\)? А если \(k \approx N\)? (\(N\) - размер датасета)

\textbf{Ответ:}
Первый случай - вырожденный, в этом случае классификатор просто не работает.

Во втором случае классификатор любой объект будет относить к тому классу,
представителей которого в исходном датасете большинство.

\item \textbf{Вопрос:}
   Как выбиралось количество фолдов для кросс-валидации? Почему именно такое?

\textbf{Ответ:}
Около 5 фолдов. Датасет очень маленький, поэтому в ином случае фолды будут
слишком мелкие. Сослаться на слайды первой лекции\footnote{Слайды первой лекции: \url{https://www.dropbox.com/sh/0fk38jg1f5ty1oz/AAD8Z_Hf8Gs6EsE3WNCBh2bWa/02-Distance.pdf?dl=0}} , стр. 18.

\item \textbf{Вопрос:}
Как правильно подобрать k - количество ближайших соседей, на которых мы
ориентируемся?

\textbf{Ответ:}
Аналогично с Leave-One-Out кросс-валидацией (Первая лекция\footnotemark[1]{}, стр. 24)

\item \textbf{Вопрос:}
Что можно делать для улучшения качества классификации, кроме подбора
гиперпараметров (т. е. числа k, выбора метрики и ядра)?

\textbf{Ответ:}
Prototype selection и распознавание аномалий (упоминалось в лекции\footnotemark[1]{}),
чтобы почистить датасет от кривых данных. Как именно это делать, не
спрашивают.

\item \textbf{Вопрос:}
   Как устроено k-d tree? Как работают kNN-запросы в нем?

\textbf{Ответ:}
Вспоминаем вычгеом и/или читаем статью\footnote{Nearest Neighbor with k-d trees: \url{http://courses.cs.washington.edu/courses/cse599c1/13wi/slides/lsh-hashkernels-annotated.pdf}}.
Обычно достаточно помахать руками и ляпнуть что-нибудь про разделение
точек по медианам при построении и отсекание квадратиков при запросе.
\end{enumerate}

\subsection{Ссылки}
\label{sec:orgheadline5}

\section{Задание 2}
\label{sec:orgheadline12}
\subsection{Постановка задачи}
\label{sec:orgheadline7}
\begin{enumerate}
\item Реализовать линейную регрессию
\item Настраивать вектор коэффициентов двумя способами - градиентным спуском и
генетическим алгоритмом
\item Для оценки качества использовать MSE (среднеквадратичную ошибку)
\item Выбирать гиперпараметры можно произвольным образом, но придется обосновать
свое решение
\item Модель должна уметь дообучаться по произвольным точкам (с консоли, если у вас
консольное приложение)
\end{enumerate}
\subsection{Датасет}
\label{sec:orgheadline8}
Ссылка: \url{https://www.dropbox.com/s/eoyz1uvis41xgrw/prices.txt?dl=0}

Датасет представляет собой зависимость цен на жилье от площади и количества
комнат.
\subsection{Hints}
\label{sec:orgheadline9}
\begin{enumerate}
\item Нормализуйте свой датасет (сдвиньте точки по каждой оси на среднее значение и
разделите на стандартное отклонение). Если вы пишете на Python, можно
воспользоваться готовым инструментом
`sklearn.preprocessing.StandardScaler`\footnote{Scikit-learn documentation - StandardScaler: \url{http://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.StandardScaler.html}}.
Это сильно упростит работу как градиентного спуска, так и эволюционного алгоритма.
\item При реализации эволюционного алгоритма особью является вектор коэффициентов
\(\Theta\). Для хорошего результата достаточно делать один вид мутации -
добавление к вектору коэффициентов случайного, нормально распределенного шума
(в Python сгенерировать случайный вектор из нормального распределения можно с
помощью функции `numpy.random.randn`\footnote{NumPy documentation - numpy.random.randn: \url{http://docs.scipy.org/doc/numpy/reference/generated/numpy.random.randn.html}}). Можно даже без скрещивания. С
размером потомства и процентом выживаемости можно поэкспериментировать,
экспериментально хорошо работает увеличение популяции в 6 раз и выживаемость
1/6 популяции.
\item Если вы чувствуете в себе силы, в качестве эволюционного алгоритма можно
выбрать алгоритм дифференциальной эволюции\footnote{Wikipedia - Differential evolution:
\url{https://en.wikipedia.org/wiki/Differential_evolution}}. Он сходится лучше, чем
наивная эволюция.
\end{enumerate}

\subsection{FAQ}
\label{sec:orgheadline10}
\begin{enumerate}
\item \textbf{Вопрос:}
   Как работает градиентный спуск?

\textbf{Ответ:}
См. презентацию\footnote{Слайды второй лекции: \url{https://www.dropbox.com/sh/0fk38jg1f5ty1oz/AABrdOgBrCJPEI5fQtlL5GHja?dl=0&preview=03-Linear.pdf}}.

Вкратце: мы минимизируем функцию ошибки \(Q(w)\), аргументом которой является
\(w = (w_1, w_2, ... w_k)\) - вектор коэффициентов линейной модели. Мы делаем
это, вычисляя функцию в какой-либо начальной точке, и сдвигая эту точку в
направлении, противоположном градиенту \(Q(w)\). Постоянно перемещаясь в
направлении антиградиента, мы приходим к минимуму.

\item \textbf{Вопрос:}
   Какое у вас условие сходимости?

\textbf{Ответ:}
Алгоритм сошелся, когда разница в значениях функции ошибки между шагами
перестала превышать некоторый маленький порог:
\(Q(w^{[k+1]}) - Q(w^{[k]}) \leqslant \varepsilon\).

\item \textbf{Вопрос:}
   Как подбирать размер шага \(\alpha\) и количество итераций?

\textbf{Ответ:}
Максимальное количество итераций можно сразу выставить каким-то разумно
большим (в районе нескольких тысяч), и перебирать \(\alpha\) от больших (5-10)
к маленьким, пока алгоритм не начнет сходиться. Особо продвинутые могут
сделать динамическую зависимость \(\alpha\) от номера итерации и/или других
условий.

На деле же датасет таков, что заходит просто потыкать несколько значений
\(\alpha\) руками, особенно если предварительно его нормализовать.

\item \textbf{Вопрос:}
   Как работает ваш эволюционный алгоритм? Как вы подбирали параметры для него?

\textbf{Ответ:}
Как написали, так и отвечайте. Задача может решаться всевозможными
эволюционными алгоритмами, описание одного из вариантов реализации можно
увидеть в подпункте Hints. Гиперпараметры (размер потомства, процент
выживаемости и пр.) можно попытаться подобрать с помощью кросс-валидации, но
на деле лучше всего работает метод "от фонаря".
\end{enumerate}
\subsection{Ссылки}
\label{sec:orgheadline11}
\end{document}
